<a href="https://colab.research.google.com/github/gabsgt/ImersaoDados-ALURA/blob/main/OpenBanking_FIAP_Banco.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import pandas as pd
url_dados_trans = 'https://query.data.world/s/kmehdy3hnaskyi63mdp4enx4ymf6ag'
trans = pd.read_csv(url_dados_trans, sep=';')
trans.head()

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (8) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

   trans_id  account_id    date    type  ... balance  k_symbol  bank account
0    695247        2378  930101  PRIJEM  ...   700.0       NaN   NaN     NaN
1    171812         576  930101  PRIJEM  ...   900.0       NaN   NaN     NaN
2    207264         704  930101  PRIJEM  ...  1000.0       NaN   NaN     NaN
3   1117247        3818  930101  PRIJEM  ...   600.0       NaN   NaN     NaN
4    579373        1972  930102  PRIJEM  ...   400.0       NaN   NaN     NaN

[5 rows x 10 columns]

In [13]:
trans['type'].value_counts()
#+/- transaction: "PRIJEM" stands for credit "VYDAJ" stands for withdrawal

VYDAJ     634571
PRIJEM    405083
VYBER      16666
Name: type, dtype: int64

In [14]:
trans['operation'].value_counts() 
#mode of transaction: "VYBER KARTOU" credit card withdrawal 
#"VKLAD" credit in cash 
#"PREVOD Z UCTU" collection from another bank 
#"VYBER" withdrawal in cash 
#"PREVOD NA UCET" remittance to another bank

VYBER             434918
PREVOD NA UCET    208283
VKLAD             156743
PREVOD Z UCTU      65226
VYBER KARTOU        8036
Name: operation, dtype: int64

In [24]:
trans['k_symbol'].value_counts()
# "POJISTNE" insurance payment 
#"SLUZBY" payment for statement 
#"UROK" interest credited 
#"SANKC. UROK" sanction interest if negative balance 
#"SIPO" household 
#"DUCHOD" old-age pension 
#"UVER" loan payment

UROK           183114
SLUZBY         155832
SIPO           118065
                53433
DUCHOD          30338
POJISTNE        18500
UVER            13580
SANKC. UROK      1577
Name: k_symbol, dtype: int64

In [18]:
trans['bank'].value_counts(normalize=True)

QR    0.081478
AB    0.079413
ST    0.079380
YZ    0.078908
GH    0.078605
EF    0.077851
KL    0.077636
UV    0.077391
OP    0.077124
IJ    0.075044
WX    0.073775
MN    0.071746
CD    0.071651
Name: bank, dtype: float64

In [23]:
trans['account'].describe()

count    2.953890e+05
mean     4.567092e+07
std      3.066340e+07
min      0.000000e+00
25%      1.782858e+07
50%      4.575095e+07
75%      7.201341e+07
max      9.999420e+07
Name: account, dtype: float64

In [8]:
url_dados_accounts = 'https://query.data.world/s/prkqbafvvcownueakq4uckhh2zyu6f'
accounts = pd.read_csv(url_dados_accounts,sep=';')
accounts.head()

   account_id  district_id         frequency    date
0         576           55  POPLATEK MESICNE  930101
1        3818           74  POPLATEK MESICNE  930101
2         704           55  POPLATEK MESICNE  930101
3        2378           16  POPLATEK MESICNE  930101
4        2632           24  POPLATEK MESICNE  930102